lisp/clbe/clbe-15.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hash Tables</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Hash Tables</h1>
<p>
Previous: <a href="clbe-14.html">14. Arrays &amp; Sequences</a>
</p>

<p>
Next: <a href="clbe-16.html">16. Structures</a>
</p>

<p>
A hash table is a way of associating pairs of objects, like a
dictionary. The objects stored in a hash table or used as keys can be
of any type. We can make hastables with MAKE-HASH-TABLE and retrieve
values associated with a given key with GETHASH:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">my-hash-table</span> (make-hash-table))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns NIL as not yet set</span>

(gethash 'color my-hash-table) 

</pre>
</div>

<p>
Similar to other structures, we use SETF to set values. Hash tables
can accommodate any number of elements, because they are expanded when
they run out of space. We can remove values with REMHASH.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns RED</span>

(setf (gethash 'color my-hash-table) 'red)

(remhash 'color my-hash-table)

</pre>
</div>

<p>
Finally, the function MAPHASH allows you to iterate over all entries
in the hash table. Its first argument must be a function which accepts
two arguments, the key and the value of each entry. Note that due to
the nature of hash tables you can't control the order in which the
entries are provided to MAPHASH (or other traversing constructs):
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(maphash #'(<span style="color: #a020f0;">lambda</span> (key value)
             (format t <span style="color: #8b2252;">"~A = ~A~%"</span> key value))
         my-hash-table)

</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
